export function charExistsInLanguage(char, language) {
    let charArray;

    switch (language) {
        case 'hebrew':
            charArray = [
                "/", "'", "ק", "ר", "א", "ט", "ו", "ן", "ם", "פ",
                "ש", "ד", "ג", "כ", "ע", "י", "ח", "ל", "ך", "ף", ".",
                "ז", "ס", "ב", "ה", "נ", "מ", "צ", "ת", ","
            ];
            break;

        case 'arabic':
            charArray = [
                'ض', 'ص', 'ث', 'ق', 'ف', 'غ', 'ع', 'ه', 'خ', 'ح',
                'ج', 'د', 'ش', 'س', 'ي', 'ب', 'ل', 'ا', 'ت', 'ن', 'م',
                'ك', 'ط', 'ئ', 'ؤ', 'ر', 'لا', 'ى', 'ة', 'و'
            ];
            break;

        case 'english':
            charArray = [
                'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
                'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', '.',
                'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.'
            ];
            break;

        case 'ukranian':
            charArray = [
                'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ї',
                'ф', 'і', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'є',
                'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю'
            ];
            break;

        case 'russian':
            charArray = [
                'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ',
                'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э',
                'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю'
            ];
            break;

        case 'portuguese':
            charArray = [
                'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
                'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ç', ';',
                'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.'
            ];
            break;

        case 'spanish':
            charArray = [
                'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p',
                'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'ñ', ',', 'ç',
                'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.'
            ];
            break;

        case 'macedonian':
            charArray = [
                'љ', 'њ', 'е', 'р', 'т', 'ѕ', 'у', 'и', 'о', 'п', 'ш', 'ѓ',
                'а', 'с', 'д', 'ф', 'г', 'х', 'ј', 'к', 'л', 'ч', 'ќ', 'ж',
                'з', 'џ', 'ц', 'в', 'б', 'н', 'м', ',', '.'
            ];
            break;

        default:
            return false;
    }

    return charArray.includes(char);
}